# load dataset

In [ ]:
import pandas as pd
uber_data=pd.read_csv("C:/Users/HP/Downloads/datasets-main/datasets-main/Uber_Drives_2016.csv")
uber_data.head()

# Display rides where CATEGORY == 'Business'.

In [ ]:
rides = uber_data[uber_data['CATEGORY*'] == 'Business']
rides

# how top 5 rides with the longest distance (MILES).

In [12]:
top5_rides = uber_data.sort_values(by='MILES*', ascending=False).head(5)
print(top5_rides)

           START_DATE*         END_DATE* CATEGORY*            START*  \
1155            Totals               NaN       NaN               NaN
269    3/25/2016 16:52   3/25/2016 22:22  Business             Latta
270    3/25/2016 22:54    3/26/2016 1:39  Business      Jacksonville
881   10/30/2016 15:22  10/30/2016 18:23  Business         Asheville
776    9/27/2016 21:01    9/28/2016 2:37  Business  Unknown Location

                 STOP*   MILES*        PURPOSE*
1155               NaN  12204.7             NaN
269       Jacksonville    310.3  Customer Visit
270          Kissimmee    201.0         Meeting
881             Mebane    195.9             NaN
776   Unknown Location    195.6             NaN

# Sort trips by distance in descending order.

In [14]:
trips = uber_data.sort_values(by='MILES*', ascending=False)
trips

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN
269,3/25/2016 16:52,3/25/2016 22:22,Business,Latta,Jacksonville,310.3,Customer Visit
270,3/25/2016 22:54,3/26/2016 1:39,Business,Jacksonville,Kissimmee,201.0,Meeting
881,10/30/2016 15:22,10/30/2016 18:23,Business,Asheville,Mebane,195.9,NaN
776,9/27/2016 21:01,9/28/2016 2:37,Business,Unknown Location,Unknown Location,195.6,NaN
...,...,...,...,...,...,...,...
1111,12/25/2016 0:10,12/25/2016 0:14,Business,Lahore,Lahore,0.6,Errand/Supplies
516,7/5/2016 16:48,7/5/2016 16:52,Business,Whitebridge,Whitebridge,0.6,Errand/Supplies
420,6/8/2016 17:16,6/8/2016 17:18,Business,Soho,Tribeca,0.5,Errand/Supplies
120,2/17/2016 16:38,2/17/2016 16:43,Business,Katunayaka,Katunayaka,0.5,Errand/Supplies
44,1/26/2016 17:27,1/26/2016 17:29,Business,Cary,Cary,0.5,Errand/Supplies